[{"company_name": "1build", "company_desc": "1build helps builders win bids by converting blueprints into material shopping lists and cost estimates with machine intelligence.", "company_desc_long": {"description": "We're a team that's committed to intellectual honesty.  We help each other get better through open discussion and respectful feedback.We are passionate about creating a world where beautiful buildings are designed and built by algorithms.", "technology": "We are creating an assembly language for construction that can convert high-level building blueprints into machine-readable algorithmic instructions on how to build.Typical engineering challenges can include: creating a script that calculates how long it takes to assemble an interior partition wallcataloguing different lumber materials by application in construction developing a graphical interface that allows point-and-click vectorization of construction plans"}, "yc_cohort": "W20", "company_details": {"fa-users": "17 people"}, "jobs": [{"job_desc": "Skills:Python, PostgreSQL, GraphQL, Kubernetes, React, TypeScript, Go1build helps construction companies to convert blueprints into bids and shopping lists of construction materials. We are serving a market of 3 million builders with a cost estimation software product and a marketplace for cost estimation services. As we're collecting thousands of datapoints about construction projects in the US, our ultimate goal it to standardize construction data and to codify building assembly and design as an explicit algorithmic language.Having completed $500M in construction projects in 2020, we are looking for an experienced Full-Stack Software Engineer who will be joining at a critical inflection point in our company’s growth. You will be helping to scale our platform to 1000s of construction businesses by year-end.You will be joining alongside a team with experience at Tesla, Uber, Apple, WeWork and Samsara. We have recently closed a $5.5M seed round from top venture funds like Y Combinator, Initialized Capital, and co-founders of PlanGrid.You should come interview with us if:You constantly seek to learn and improve yourself.You're passionate about tech, and opinionated about what makes it good.You excel at communicating via written language, both in code and in English.You know how the web works.You naturally contribute to a culture of excellence.You write code for fun.You're a deep thinker.You know how to build web applications.Your work ethic drives you to aggressive productivity with high standards.Technologies we work with:PythonGoReactTypeScriptGraphQLKubernetesTerraformWhy join us:A opportunity to reimagine the construction industry from first principlesA chance to create a product-driven organization as an early engineerCompetitive base + equity compensation planMedical, dental, and vision InsuranceRemote-first benefits: home office stipend and co-working allowance", "job_type": "Full-Stack Software Engineer", "job_title": "Full-Stack Software Engineer", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "min_years_experience": 3}, "job_skills": ["PYTHON", "POSTGRESQL", "GRAPHQL", "KUBERNETES", "REACT", "TYPESCRIPT", "GO"]}, {"job_desc": "Skills:Go, Kubernetes, React, TypeScript, Amazon Web Services (AWS)1build helps construction companies convert blueprints into bids and shopping lists of construction materials. We are serving a market of 3 million builders with a cost estimation software product and a marketplace for cost estimation services. As we're collecting thousands of datapoints about construction projects in the US, our ultimate goal it to standardize construction data and to codify building assembly and design as an explicit algorithmic language.Having completed $500M in construction projects in 2020, we are looking for an experienced Head of Engineering who will be joining at a critical inflection point in our company’s growth. You will be helping to scale our platform to 1000s of construction businesses by year-end.You will be joining as an executive leader alongside a team with experience at Tesla, Uber, Apple, WeWork and Samsara. We have recently closed a $5.5M seed round from top venture funds like Y Combinator, Initialized Capital, and co-founders of PlanGrid.Your responsibilities will include:Managing, coaching, and recruiting a diverse team of engineers across timezonesInterpreting product specs and designs for technical implementationMaking architectural decisions that can support the platform at scaleSetting and maintaining a culture of product excellenceAbout you:You are highly driven individual who’s excited about turning scrappy startups into industry leadersCross disciplinary thinker & lifelong learner who loves to dig into the nuts and bolts of the challenges at handPlayer-coach who is able to lead effectively through coaching and help unblock your teammates when faced with technical challengesRequirements:6+ years of work experience as a software engineer at fast growing companiesPast experience leading and scaling high-output software engineering teamsSignificant Dev-Ops & Cloud Computing (AWS preferred) experience with tools like Kubernetes, Terraform, Consul, Envoy, Serverless & moreExperience designing, shipping and maintaining large B2B SaaS products & APIs powered by gRPC, GraphQL & RESTTechnologies we work with:PythonGoReactTypeScriptKubernetesTerraform", "job_type": "Head of Engineering", "job_title": "Head of Engineering", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "min_years_experience": 6}, "job_skills": ["GO", "KUBERNETES", "REACT", "TYPESCRIPT", "AMAZON WEB SERVICES (AWS)"]}], "founders": [{"founder_name": "Dmitry Alexin", "founder_img": "./waas_full_details_dump_files/b945536b9cc60a7f6d48cd73bbf6dce68638c51a.jpg", "founder_linkedin": "https://www.linkedin.com/in/dzhdankin/", "founder_experience": "Education: International Relations at Sciences Po; Harvard Business School; Economics at Rutgers University", "founder_education": null}]}, {"company_name": "A Thinking Ape", "company_desc": "Mobile games.", "company_desc_long": {}, "yc_cohort": "W08", "company_details": {"fa-users": "75 people"}, "jobs": [], "founders": [{"founder_name": "Kenshi Arasaki", "founder_img": "./waas_full_details_dump_files/b357de091097d29823a1383174dc2bf59982eb01.jpg", "founder_linkedin": null, "founder_experience": "Education: BSc, Computer Science at University of Calgary", "founder_education": null}, {"founder_name": "Eric Diep", "founder_img": "./waas_full_details_dump_files/4db44a5729717790b00ef570a38dcba09c76b670.jpg", "founder_linkedin": "https://linkedin.com/in/dieperic", "founder_experience": "https://ediep.ca/about", "founder_education": null}]}, {"company_name": "Able Jobs", "company_desc": "Job training app in India for roles in sales, support & marketing", "company_desc_long": {"description": "Let's start with a short storyAnjali is a B.Com. graduate from a small town in India. She shifted to Bangalore 6 months ago and has been hunting jobs since then. She installed the Able Jobs app and learned how to pitch a product. After a couple of weeks of rigorous online training, she got a job as a Business Development Executive in a growing startup. **Imagine handholding millions in the toughest phase of their lives - landing a good job. It requires to harvest their motivation while making it easy to learn useful job skills. We prepare them, celebrate when they succeed & pick them up on failure"}, "yc_cohort": "W20", "company_details": {"fa-users": "18 people"}, "jobs": [{"job_desc": "Anjali is a B.Com graduate from a small town in India. She shifted to Bangalore 6 months ago and has been hunting jobs since then. She installed the Able Jobs app and learned how to pitch a product. After a couple of weeks of rigorous online training, she got a job as a Business Development Executive in a growing startup.Imagine millions of Indians consuming your content to be victorious in their toughest phase of life: landing a good job. It requires intense empathy for job-seekers with a deep desire to make them successful. We are growing 2x MoM in terms of active students - an amazing entrepreneurial challenge to pull off.We are on a mission to eradicate unemployment. We have already placed 700+ people in a few months. Our app trains freshers on sales, operations & marketing to help them crack a job in just a few weeks. We also help companies hire entry-level talent. We are backed by world-class investors like Y Combinator & Saif Partners.Who we're looking forPaul Graham said Startup = GrowthWe are looking for a high-ownership, problem-solving individual who will be directly responsible for the constant growth of the primary metrics for the company. You should also have:Excellent communication and organizational skills to get things doneGoal driven and hardworkingCan figure out multiple ways to solve a problemResponsibilitiesManage the talent acquisitions team and identify the best talent for customer companiesCreate new business relationships (demand) and serve as the primary point of contact for existing partners. Supervise and manage enterprise relations.Be accountable for Customer success and ensure that Able Jobs is the go-to place for hiring entry-level talentDefine and constantly improve operational team metrics; establish a system for tracking metrics and key milestonesIdentify best practices; create a predictable, repeatable and sustainable method to scale Customer SuccessUndertake initiatives and gather tech, product, design, and growth to solve core business problemsManage payments and be responsible for the revenue realizationRecruiting: Manage hiring process, identify the best talent and check fit for Able JobsQualificationsUndergraduate/Graduate degree A previous entrepreneurial experienceBenefitsChance to be with the right team, at the right time.Work directly with founders who come from amazing companies like Udacity, Playment, and Yatra.Create a humongous societal impact by helping people get good jobs.", "job_type": "Manager Business", "job_title": "Manager Business ", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "salary": "$20k - $40k", "min_years_experience": 3}, "job_skills": null}], "founders": [{"founder_name": "Ravish Agrawal", "founder_img": "./waas_full_details_dump_files/98e9abcfc6f2ef7b07953982fc91718b82e23fb9.jpg", "founder_linkedin": "https://www.linkedin.com/in/ravishagrawal/", "founder_experience": "Co-Founder & CEO Able Jobs. Previously worked with Udacity. Growth Marketing Nerd", "founder_education": null}, {"founder_name": "Svatantra Kumar", "founder_img": "./waas_full_details_dump_files/c64318fab14bcc77c5a98b258965975d355d0ecc.jpg", "founder_linkedin": "https://www.linkedin.com/in/swat/", "founder_experience": "Education: BTech, Computer Science And Engineering at Harcourt Butler Technical University", "founder_education": null}, {"founder_name": "Siddharth Srivastav", "founder_img": "./waas_full_details_dump_files/34a96ecae4d3612015ebcade2cf86c28852c3d8b.jpg", "founder_linkedin": "https://www.linkedin.com/in/siddharthsrivastav/", "founder_experience": "Education: BTech, Computer Science And Engineering at Harcourt Butler Technical University; Entrepreneurial Studies at MIT", "founder_education": null}]}, {"company_name": "Accredible", "company_desc": "", "company_desc_long": {"description": "Accredible is connecting education with economic value. We want hiring to be about what you can do, your skills and potential and we want education to be better at improving careers.In the past six years we’ve built the best credentialing product in the world. Universities, associations, tech companies and others are able to create, deliver and manage tens of thousands of digital certificates and open badges with just a few clicks. Our customers include Google, UC Berkeley, and IEEE and we’ve delivered over 3.5 million credentials to over 3 million users.We’re a growing team of talented and dedicated individuals looking to keep up momentum and maintain a friendly, open democratic culture.", "technology": "BEYou’ll be helping to build and maintain a back-end API that serves over 250,000 new users per month and over 1,500,000 requests per day. Our customers expect reliability, stability and speed. You’ll be pushing updates every day to improve our codebase and be able to see instant feedback from our customers & users.We use Ruby on Rails and PostgreSQL on top of a few AWS services. Our approach is Agile, test heavy and we push releases as soon as they’re ready, typically more than 10 a week.FEOur FE is built using AngularJS and we host all our properties on Netlify."}, "yc_cohort": "IK12", "company_details": {"fa-users": "11 people"}, "jobs": [{"job_desc": "Skills:Ruby on RailsThe RoleYour role is essential to our success! You’ll be helping to build and maintain a back-end API that serves over 250,000 new users per month and over 1,500,000 requests per day. Our customers expect reliability, stability and speed. You’ll be pushing updates every day to improve our codebase and be able to see instant feedback from our customers & users.We use Ruby on Rails and PostgreSQL on top of a few AWS services. Our approach is Agile, test heavy and we push releases as soon as they’re ready, typically more than 10 a week.You won’t be doing this alone as we have a world-class product team you’ll be working with. You’ll have support from a designer, a front-end engineer, a senior back-end engineer and our Chief Technology Officer will be responsible for the work that you do. We’ll be expecting high quality work but don’t worry - you’ll receive constructive feedback and guidance on a regular basis. We meet every day and everybody has input and the ability to make our work and the way we work better.You’ll have a lot of decision making power, autonomy and trust. We make decisions democratically and give team members the time, resource and authority to work on what they think is most important. This is a fantastic opportunity to join a fast growing, profitable startup where there are many opportunities to obtain promotions based upon merit, hard work and dedication. Compensation & Benefits£45,000+ salary.Flexible hours.Remote work for up to 2 days per week (we’re flexible on times and places).A close, dedicated startup team who are passionate about improving the education system and who are backed by some of Silicon Valley’s top venture capital investors.2 hours per week (paid) to spend learning anything you like, even if it’s not related to your role, plus a budget to spend on learning materials. We love education and we believe in nurturing your growth!A promise to invest in your growth personally and professionally. Wherever you’d like to go and whatever you’d like to do we’ll be there to support you.Fast promotion opportunities. We’ve got a track record for internal promotion to senior roles within the first year of employment.Pension scheme.28 days holiday.Your skills & competenciesWe are looking for you to demonstrate to us that you have these skills & competencies:Rails experience. Has used Rails professionally for at least 2 years.Learns quickly. Demonstrates the ability to quickly absorb and make use of new information. Can research best practices and make use of them.Enthusiastic. Wants to learn and grow, is excited to take on new challenges.Independent Problem solving. Is able to independently solve difficult technical problems & provide solutions or work arounds. Asks for help when they need it but tries to solve things themselves.Attention to detail. Does not let important details slip through the cracks and slow or jeopardize a release.Organization & Planning & Independence. Plans, organizes and schedules in an efficient manner. Knows which priorities are important and chooses to work on those. Doesn’t need constant input but is able to ask for help when needed.", "job_type": "Software Engineer", "job_title": "Software Engineer", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "salary": "$58k - $65k", "equity": "0.10%", "min_years_experience": 1}, "job_skills": ["RUBY ON RAILS"]}, {"job_desc": "Skills:Ruby, PostgreSQL, Amazon Web Services (AWS)The RoleYour role is essential to our success! You’ll be helping to build and maintain a set of back-end APIs that serve over 1,000,000 new visitors per month and over 5,000,000 API requests per day. Our customers expect reliability, stability and speed. You’ll be pushing updates regularly to improve our codebase and be able to see instant feedback from our customers & users.We use Ruby on Rails and PostgreSQL on top of a few AWS services. Our approach is Agile, test heavy and we push releases once a week.You won’t be doing this alone as we have a world-class product team you’ll be working with. You’ll have support from senior Ruby developers who can help you to improve your skills, front-end engineers, our Product Owner, Head of Engineering and our Chief Technology Officer. We’ll be expecting high quality work but don’t worry - you’ll receive constructive feedback and guidance on a regular basis. We meet every day and everybody has input and the ability to make our work and the way we work better.You’ll have a lot of decision making power, autonomy and trust. We make decisions democratically and give team members the time, resource and authority to work on what they think is most important. This is a fantastic opportunity to join a fast growing, profitable startup where there are many opportunities to obtain promotions based upon merit, hard work and dedication. We’re scaling quickly and you’ll be involved in solving the technical challenges that come from increased scale and evolving into microservices. You’ll be able to work with interesting technology such as Blockchain, Citus and analytics related frameworks.Compensation & Benefits$60,000+ salary.Flexible hours.Remote work.A close, dedicated startup team who are passionate about improving the education system and who are backed by some of Silicon Valley’s top venture capital investors.2 hours per week (paid) to spend learning anything you like, even if it’s not related to your role, plus a budget to spend on learning materials (courses, books, conferences). We love education and we believe in nurturing your growth!A promise to invest in your growth personally and professionally. Wherever you’d like to go and whatever you’d like to do we’ll be there to support you.Fast promotion opportunities. We’ve got a track record for internal promotion to senior roles within the first year of employment.Pension scheme (UK only).28 days holiday.Your skills & competenciesWe are looking for you to demonstrate to us that you have these skills & competencies:Rails experience. You have used Rails professionally for at least 2 years, preferably in a SaaS environment.Learns quickly. You demonstrate the ability to quickly absorb and make use of new information. You are able to research best practices and make use of them.Communication. You are able able to clearly and succinctly communicate ideas and problems to team mates & to customers - both written and verbal.Enthusiastic. You want to learn and grow, and are excited to take on new challenges.Independent Problem solving. You are able to independently solve difficult technical problems & provide solutions or work arounds. You ask for help when you need it but try to solve things yourself.Attention to detail. You don’t let important details slip through the cracks and slow or jeopardize a release. You review your own work before submitting a pull request.Organization & Planning & Independence. You plans, organizes and schedule in an efficient manner. You are able to prioritise and choose to work on the most important tasks.It’s essential that you’re honest, have a high level of integrity, are able to communicate and are able to use feedback to learn and develop professionally.", "job_type": "Software Engineer (Remote)", "job_title": "Software Engineer (Remote)", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "salary": "$60k - $62k", "min_years_experience": 3}, "job_skills": ["RUBY", "POSTGRESQL", "AMAZON WEB SERVICES (AWS)"]}, {"job_desc": "Skills:Ruby on Rails, Angular, Amazon Web Services (AWS)Accredible’s talented product team of engineers build and maintain a number of web properties such as www.credential.net and dashboard.accredible.com. These web platforms are used by millions of people every year. Our customers expect reliability, stability and speed.Your role is to ensure the engineering team has the right people, enabled to produce good quality software. You’ll be responsible for:Managing the Engineering team.Software development processes, practices and quality.Service uptime and platform performance.You won’t be doing this alone as we have a world-class product team you’ll be working with. You’ll have support from a product owner, two very senior front-end engineers, three senior back-end engineers and a junior front-end engineer. Our Chief Technology Officer will be responsible for the work that you do and will be working with you regularly. We’ll be expecting high quality work but don’t worry - you’ll receive constructive feedback and guidance on a regular basis.You’ll have a lot of decision making power, autonomy and trust. We make decisions democratically and give team members the time, resource and authority to work on what they think is most important.Success in your first year would be:Engineering team members are performing well. You’re able to hire new engineers to build an effective team.You’ve empowered the team to improve code quality. Test coverage is up, incidence of bugs has been reduced, documentation is broader and deeper.Service performance is good. You’ve reduced response times, load times and regularly report key engineering metrics such as uptime.Your team have reduced technical debt and are working to support the scaling customer base.This is a fantastic opportunity to join a fast growing, profitable startup where there are many opportunities to obtain promotions based upon merit, hard work and dedication.We’re looking for an in-person candidate to work from our UK office in Ely, Cambridgeshire.Compensation & BenefitsCompetitive salary.Flexible hours.Remote work for up to 2 days per week (we’re flexible on times and places).A close, dedicated startup team who are passionate about improving the education system and who are backed by some of Silicon Valley’s top venture capital investors.2 hours per week (paid) to spend learning anything you like, even if it’s not related to your role, plus a budget to spend on learning materials. We love education and we believe in nurturing your growth!A promise to invest in your growth personally and professionally. Wherever you’d like to go and whatever you’d like to do we’ll be there to support you.Fast promotion opportunities. We’ve got a track record for internal promotion to senior roles within the first year of employment.Pension scheme.28 days holiday.Your skills & competenciesWe are looking for you to demonstrate to us that you have these skills & competencies:Engineering Management. You have experience managing a team of engineers, with some remote team members. You are able to coach team members to help them perform. You are able to mediate effectively when team members disagree.Remote management: Able to manage effectively not just in-person employees, but remote ones too, including in other timezones.Broad technical experience & decision making. You are able to understand and make decisions of a technical nature on approach, architecture, stack, etc. You are able to use the more knowledgeable domain experts on your team to reach effective decisions. You document these decisions and remind the team of them going forward.Learns quickly. You can demonstrate the ability to quickly absorb and make use of new information. You can research best practices and make use of them.Enthusiastic. You want to learn and grow, and are excited to take on new challenges.Attention to detail. You do not let important details slip through the cracks and slow or jeopardize a release.Organization & Planning. You plan, organize and schedule in an efficient manner. You know which priorities are important and choose to work on those.It’s essential that you’re honest, have a high level of integrity, are able to communicate and are able to use feedback to learn and develop professionally.", "job_type": "Head of Engineering", "job_title": "Head of Engineering", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "salary": "$90k - $10k", "equity": "0.10% - 0.20%", "min_years_experience": 6}, "job_skills": ["RUBY ON RAILS", "ANGULAR", "AMAZON WEB SERVICES (AWS)"]}], "founders": [{"founder_name": "Alan Heppenstall", "founder_img": "./waas_full_details_dump_files/12ff2db27448f874b535b63e45ecf8e956676a27.jpg", "founder_linkedin": null, "founder_experience": "Education: MS, Computer Science at Durham University; BSc, Computer Science at University of Durham", "founder_education": null}, {"founder_name": "Danny King", "founder_img": "./waas_full_details_dump_files/be670e05dfef565d166a6a92b87b748429f6a495.jpg", "founder_linkedin": null, "founder_experience": "Education: Example University; Computer Science With European Studies at Durham University", "founder_education": null}]}, {"company_name": "Acho", "company_desc": "Collaborative database management on cloud", "company_desc_long": {"description": "Acho (analysts collaboration hub) helps analysts build data pipeline with no coding. Within a few clicks, an analyst can build a database for data she/he gets from Google Analytics, Stripe or any third-party app. The team is currently based in Boston. We're looking for developers preferably with 2-3 years of experience.", "technology": "HTML & CSS         Javascript (Vue.js, bootstrap, axios, redux, google analytics, jquery, datatables, webpack)         RESTful API Design & Implementation (OpenAPI)         MySQL Commands & Utilities (Mysqldump...)         Elasticsearch         DynamoDB         Docker & Docker-compose         Python3 (Requests, PyMySQL, SQLAlchemy, Scrapy, multiprocessing, apscheduler, pandas, numpy...)         Linux Commands & Utilities (Ubuntu, screen, crontab)         Kubernetes (GKE)         Load Balancer (Ingress)         Compute Engine (GCE)         Cloud Endpoint         MySQL (Cloud SQL)"}, "yc_cohort": "W20", "company_details": {"fa-users": "4 people"}, "jobs": [{"job_desc": "Skills:Kubernetes, Hive, HBase, Kafka, Spark, Hadoop, Elastic Stack (ELK)Acho is a place  where you can find, process and publish data. No coding required, you may integrate different databases in one place, build complex data pipelines and publish data to wherever you want. The team is just 3 people (2 developers), currently based in Boston. We're looking for developers preferably with 2-3 years of experience.", "job_type": "Software Engineer", "job_title": "Software Engineer ", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "salary": "$80k - $120k", "equity": "1.00% - 5.00%", "min_years_experience": 3}, "job_skills": ["KUBERNETES", "HIVE", "HBASE", "KAFKA", "SPARK", "HADOOP", "ELASTIC STACK (ELK)"]}, {"job_desc": "Skills:Image Processing, Data AnalyticsAbout AchoAcho is the next-gen data warehouse that everyone can use. With its quickly evolving set of solutions and playbooks, Acho is growing to be a leading player in the Cloud Data Warehouse market. Analysts, engineers, and scientists from world leading companies are all using Acho to integrate, process and publish their valuable data assets. Based in Boston, Acho was founded by enterprise technology entrepreneur Vincent Jiang and is backed by Y Combinator.About the teamOur team is small and agile. As a Product Designer, you will work closely with the CEO and our CTO to communicate the most innovative product ideas and realize them before our clients within a very short time. Team Acho champion great design, seemless UI/UX, and iconic visual branding language.What you'll be doing on the team:• Own the design process for our team, collaborating with the product manager, customer advocate, and solution engineers to ship customer value.• Rapidly build prototypes with apps and codes before working with engineers to ship production-ready, client-facing products.• Build strong online presence for our product by producing compeling graphics, videos and digital assets for markeing materials.• Spend time talking to customers, understanding their problems, and validating that your solutions solve a real problem for them.• Build strong marketing campaign by communicating our idea with clientsAbout you and what type of skills youll need:• You need to know how to create amazing digital interface using Adobe products or equivalent• You need to know the basics of front-end development and be able to build prototypes using Vue.js, React.js, Bootstrap etc.• You need to have at least 3+ years of experience designing, marketing, or selling digital products• You need to understand some of the basic business logics in B2B markets.• You need to be very detail oriented and organized.• You love to write and publish your ideas online.• You love listening to customers, discussing strategy with colleagues,Acho is committed to being an equal opportunity employer. We celebrate and support diversity, and work every day to create an inclusive work environment that represents the world that we live in", "job_type": "Product Designer", "job_title": "Product Designer", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "salary": "$50k - $75k", "equity": "1.00% - 4.00%", "min_years_experience": 3}, "job_skills": ["IMAGE PROCESSING", "DATA ANALYTICS"]}], "founders": [{"founder_name": "Vincent Jiang", "founder_img": "./waas_full_details_dump_files/e1ebcff79f0b7f65c2270baec5d3d621412c06b6.jpg", "founder_linkedin": "https://www.linkedin.com/in/vincent-jiang-55740855/", "founder_experience": "Education: Engineering at Harvard University; Engineering at University of Illinois at Urbana-Champaign; Cross at Massachusetts Institute of Technology", "founder_education": null}, {"founder_name": "Chenfeng Liu", "founder_img": "./waas_full_details_dump_files/a65a0713fd487568c7cdce11deca1f731d1a1652.jpg", "founder_linkedin": "https://www.linkedin.com/in/chenfeng-liu-work", "founder_experience": "Education: Computer Engineering at Iowa State University", "founder_education": null}]}, {"company_name": "Actiondesk", "company_desc": "Access all your live data in one place", "company_desc_long": {"description": "At Actiondesk, we're building the future of spreadsheets. Spreadsheets are used by around 1 billion people in the world, yet were designed in the 80's and haven't been reinvented since.Actiondesk is a full fledged spreadsheet software with 3 key features aka superpowers:The ability to Import data from any data sources and having that data refreshed automaticallyThe ability to tie in data from a spreadsheet to data in another system (CRM, database etc). Whenever you make a change in the spreadsheet, it reflects in the initial data source.The ability to trigger “actions” with an excel like formula on a one off basis or an automated schedule. Think daily slack messages or emails.All of this using only excel-like formulas", "technology": "Our stack: Scala, Kafka, Kubernetes, GCP, Vue.js\nWe use a microservice achitecture.\nOur backend connects to dozens of APIs, stores and transforms data leading to a lot of interesting problems. \nOn the frontend side, we're building from scratch a spreadsheet interface, which doesn't come without its challenges either :)"}, "yc_cohort": "S19", "company_details": {"fa-users": "4 people"}, "jobs": [{"job_desc": "(No agency / consultant please!)At Actiondesk, we're building the future of spreadsheets. Spreadsheets are used by around 1 billion people in the world, yet were designed in the 80's and haven't been reinvented since.Actiondesk is a full fledged spreadsheet software with 3 key features aka superpowers:The ability to Import data from any data sources and having that data refreshed automaticallyThe ability to tie in data from a spreadsheet to data in another system (CRM, database etc). Whenever you make a change in the spreadsheet, it reflects in the initial data source.The ability to trigger “actions” with an excel like formula on a one off basis or an automated schedule. Think daily slack messages or emails.All of this using only excel-like formulas.You’ll be a good fit if you’re:Self-starting and entrepreneurialPassionate about taking on big challengesEnthusiastic about teamwork, learning and teachingComfortable with uncertaintyObsessed with building a good looking and easy to use interfaceGenuinely curious how people interact with the product you're buildingA Figma starUnderstand the basics of how spreadsheets and data analysis work.\"Vlookup\" or \"SQL query\" shouldn't be scary terms to youYou'll need to be fast in understanding users when they tell you about their complex workflowsIf you know how to use webflow and / or the fundamentals of HTML / CSS, that's a big plus!What we offer:Working on reinventing an interface used by ~1 billion peopleLots of responsibilities & autonomy: you'll be the lead on all things product designWe're still a tiny team (5 people), you'll have significant influence on company wide decisionsJoining an extremely ambitious early stage startup while it's getting ready to scaleWhat will you do?You'll own end to end the design of new features.\n    - You'll work with our CEO / PM and talk to users to understand the need, and run tests.\n    - With the enginering team to understand technical possibilities\n    - And will create mockups from rough prototypes to high fidelity mockups\nOwn and structure our design systemSome more details:We're well fundedWe're backed by Y Combinator, and other top notch investorsWe reached +1,800 upvotes on Product Hunt: https://www.producthunt.com/posts/actiondeskWe have ~3,000 companies on our waiting list and growingOur values:No egoDon’t chat: do and measureRadical transparencyOwn problemsChallenge everythingTo apply, please write an email to jonathan at actiondesk.io\nPlease use the subject \"I ❤️ spreadsheets\" and tell us a bit about why you'd like to work with us!", "job_type": "Product Designer who understands data", "job_title": "Product Designer who understands data", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "salary": "$80k - $130k", "min_years_experience": 3}, "job_skills": null}, {"job_desc": "Skills:ScalaYou’ll be a good fit if you’re:Self-starting and entrepreneurialPassionate about building an ambitious product and solving big problemsAn expert in Scala or functional programingAn excellent engineer with a growth mindsetVery comfortable with uncertainty and changesGet shit done and don't make excusesNice to have:Experience with Kafka or other PubSub messaging systemExperience with KubernetesKnowledge of Reactive Systems and/or Actor ModelWhat we offer:Lots of responsibilities & autonomyBeing one of the very first engineers of the teamSignificant technical challengesBeing part of a top level tech teamSignificant equity (0.5%-3%)Visa sponsorship for french citizensWe're a tiny team, your impact will be significant.We are well funded, and are backed by Y Combinator.", "job_type": "Senior Backend Software Engineer", "job_title": "Senior Backend Software Engineer", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "salary": "$90k - $120k", "equity": "0.50% - 3.00%", "min_years_experience": 3}, "job_skills": ["SCALA"]}, {"job_desc": "Skills:JavaScriptYou’ll be a good fit if you’reSelf-starting and entrepreneurialPassionate about building an ambitious product and solving big problemsAn excellent engineer with a growth mindsetVery good at Javascript (We use Vue.js but specific Vue experience is not a must have)Used to working with javascript frontend frameworks (React, Angular, Vue)Very comfortable with uncertainty and changesGet shit done and don't make excusesNice to haveExperience with CanvasExperience with Scala or functional programingExperience with Kafka or other PubSub messaging systemKnowledge of Reactive Systems and/or Actor ModelWhat we offerLots of responsibilities and autonomyBeing engineer #3 of the teamSignificant technical challengesBeing part of a top level tech teamWe're still a tiny team (5 people), you'll get an opportunity for great impact and have significant influence on company wide decisionsSignificant equityWhat will you do?Own and build features end to end, starting by scoping the feature with our CEO / PM and designer. Make important architecture decisions with the rest of the teamBuild a great product that our users will loveWe are well funded, and are backed by Y Combinator (obviously)", "job_type": "Senior Frontend Software Engineer", "job_title": "Senior Frontend Software Engineer", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "salary": "$90k - $145k", "equity": "0.50% - 3.00%", "min_years_experience": 3}, "job_skills": ["JAVASCRIPT"]}], "founders": [{"founder_name": "Jonathan Parisot", "founder_img": "./waas_full_details_dump_files/5e193df4161da5ac91ae7ffa2b2046381ebc75bc.jpg", "founder_linkedin": "https://www.linkedin.com/in/jonathan-parisot-10054625/", "founder_experience": "Education: Web Development at Le Wagon; Entrepreneurship at NEOMA Business School", "founder_education": null}]}, {"company_name": "Activeloop", "company_desc": "Cloud for AI.", "company_desc_long": {"description": "The landscape of computation resources across different special hardware and cloud providers is becoming increasingly fragmented.We're building a platform that unifies and abstracts away infrastructure for easier and highly efficient machine learning and deep learning.", "technology": "https://github.com/activeloopai/Hub"}, "yc_cohort": "S18", "company_details": {"fa-users": "5 people"}, "jobs": [{"job_desc": "Skills:C++, Python, TensorFlowWe are looking for an experienced engineer with exposure to ML, equipped with sophisticated software engineering skills.ResponsibilitiesOversee engineering effort and development team including open source, backend, frontend, and other projects.Monitor reliability and performance of all internal systems to suggest improvementsManage software development projects by setting requirements, goals and timelinesDesign strategies for future development projects based on the company’s overall objectives and resources in cooperation with Sales and MarketingHire engineers and coordinate their trainingCoordinate with external stakeholders for new integrations and toolsRequirements[Preferred[ 3-5 years of Machine Learning/Deep Learning/HPC/Distributed Computing experience, with a working knowledge of and a passion for NumPy, PyTorch and Tensorflow including strong programming skills in Python and C++.Preferred Work experience as a director of engineering or in a similar senior-level position at an engineering departmentExtensive experience with cloud services and/or running machine learning models in production including knowledge of Docker, Kubernetes, CircleCI.Ability to pick the best tool for the job and integrate an array of technologies into a reliable High Performance Computing solution.Fluency in using Git and GitHub. Familiarity with open source. Hands-on experience in back-end and front-end developmentGood understanding of agile methodologies and proven track record of leading engineering teams in executing projects against tight deadlines.We also expect you to:  *To join a highly motivated, curious, hardworking explorers in the field of AIHave a builder attitude - you love building cool things that matter!Work closely with the founding team in developing hyper-scalable software for ML.Proactively identify and anticipate problems and provide tangible solutions.Enjoy the startup journey towards building endurable, scalable business.", "job_type": "Head of Engineering", "job_title": "Head of Engineering", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "min_years_experience": 3}, "job_skills": ["C++", "PYTHON", "TENSORFLOW"]}, {"job_desc": "Skills:Python, Distributed Systems, Deep Learning, Data ModelingWe are looking for an experienced ML engineer equipped with sophisticated software engineering skills and a proven track record in leading open-source software.We expect you to have:3-5 years of Machine Learning/Deep Learning/HPC/Distributed Computing experience, with a working knowledge of and a passion for NumPy, PyTorch and Tensorflow including strong programming skills in Python and C++.Fluency in using Git and GitHub, and a track recording effectively contributing to open source projects.The ability to pick the best tool for the job and integrate an array of technologies into a reliable High Performance Computing solution.Experience with cloud services and/or running machine learning models in production including knowledge of Docker, Kubernetes, CircleCI.We expect you to:To join a highly motivated, curious, hardworking explorers in the field of AIHave a builder attitude - you love building cool things that matter!Proven track record of executing projects against tight deadlines.Work closely with the founding team in developing hyper-scalable software for ML.Proactively identify and anticipate problems and provide tangible solutions.Enjoy the startup journey towards building endurable, scalable business.About ActiveloopWe're building Cloud for AI, you can think of operating system for machine learning applications.With an increasingly fragmented landscape of computation resources across different special hardware and cloud providers, Activeloop unifies and abstracts away infrastructure for easier and highly efficient machine and deep learning.The company is founded by PhDs from Princeton University and backed by Y Combinator and other prominent investors from Silicon Valley.", "job_type": "Head of Machine Learning", "job_title": "Head of Machine Learning", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "min_years_experience": 3}, "job_skills": ["PYTHON", "DISTRIBUTED SYSTEMS", "DEEP LEARNING", "DATA MODELING"]}, {"job_desc": "Minimum qualifications:Bachelor's degree (completed or in progress) or equivalent practical experience.\nPrior experience in sales, business development, and/or account management.\nAbility to speak and write in English fluently and idiomatically.Preferred Qualifications:Experience in building a pipeline through prospecting and cold outreach.\nExperience planning, delivering, and implementing email marketing campaigns. Experience in software as a service (SAAS) or platform as a service (PAAS) sales.\nBackground in computer science and/or data science.\nAbility to think strategically about challenges, and to develop recommendations and action plans.\nExcellent communication and influence skills.About the jobAs a Business Development Associate, you'll help us land our next biggest clients. In this role, you will focus on developing relationships with established businesses in AI/ML space, helping them optimize their machine learning cycle. You will build and manage a pipeline of clients working towards strategic objectives and collaborate with internal stakeholders to foster the long-term success of new customers and partners. Also, you will identify new product opportunities based on the feedback you gain from the prospects.ResponsibilitiesBuild and close a pipeline of business by proactively identifying and initiating relationships with new clients, working in close partnership with our Marketing team.\nCultivate important business agreements through customer outreach and establishing new partnerships.\nConsult with clients and prospects to understand their pains and needs, and translate them into product requirements for the engineering team.\nDesign outbound sales strategies using product knowledge to drive long-­term success for our customers.\nNurture the inbound leads and serve as a point of contact throughout the sales funnel.", "job_type": "Business Development Associate", "job_title": "Business Development Associate", "details": {"visa_required": false, "remote": false, "new_grads_ok": true}, "job_skills": null}, {"job_desc": "About the jobAs a Business Development Manager, you'll help us land our next biggest clients. In this role, you will focus on developing relationships with established businesses in AI/ML space, helping them optimize their machine learning cycle. You will build and manage a pipeline of clients working towards strategic objectives and collaborate with internal stakeholders to foster the long-term success of new customers and partners. Also, you will identify new product opportunities based on the feedback you gain from the prospects.Minimum qualificationsBachelor's degree or equivalent practical experience.2+ years of experience in a quota-carrying software sales and strategic account management at an enterprise B2B software company selling to enterprise accounts.Experience of engaging with accounts in selling a portfolio of products at C-level.Ability to speak and write in English fluently and idiomatically.Preferred qualificationsExperience in building a pipeline through prospecting and cold outreach.4+ years of experience selling Infrastructure Software, Databases, Analytic Tools, or Applications Software with a demonstrated track record in exceeding sales goals.Experience planning, delivering, and implementing email marketing campaigns. Experience in software as a service (SAAS) or platform as a service (PAAS) sales.Background in computer science and/or data science.Ability to think strategically about challenges, and to develop recommendations and action plans.Excellent communication and influence skills.Background in computer science and/or data science.ResponsibilitiesBuild and close a pipeline of business by proactively identifying and initiating relationships with new clients, working in close partnership with our Marketing team.Cultivate important business agreements through customer outreach and establishing new partnerships.Lead and manage entire sales-cycles with experience in negotiating terms and understanding associated legal and business risks (could include presenting multi-year agreements to CEO and C-level executives).Lead detailed account strategy in generating and developing business growth opportunities, working cross-functionally to maximize business impact, and open up opportunities with large enterprise customers.Consult with clients and prospects to understand their pains and needs, and translate them into product requirements for the engineering team.Design outbound sales strategies using product knowledge to drive long-­term success for our customers.Nurture the inbound leads and serve as a point of contact throughout the sales funnel.About usWe're building the Cloud for AI - an operating system for machine learning applications.Currently, we are developing an open-source product (https://github.com/activeloopai/Hub) that helps data scientists achieve faster inference at lower cost. The company is founded by PhDs from Princeton University and ex-Yandex and ex-Google employees. We are backed by Y Combinator and other prominent investors from Silicon Valley.", "job_type": "Head of Business Development", "job_title": "Head of Business Development ", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "min_years_experience": 3}, "job_skills": null}], "founders": [{"founder_name": "Davit Buniatyan", "founder_img": "./waas_full_details_dump_files/97eb7274150d8fc4b97b46652b6cbf983b4d18dc.jpg", "founder_linkedin": "https://www.linkedin.com/in/davidbuniatyan", "founder_experience": "Ph.D. candidate, Founder at Snark AI", "founder_education": null}]}, {"company_name": "adyn", "company_desc": "The first test designed to prevent birth control side effects", "company_desc_long": {"description": "adyn is on a mission to make scientific discovery more inclusive so everyone can live their healthiest life.\n‍\nOur vision is to be earth's most inclusive and patient-centric personalized medicine company. We are living in the age of the “medical research gender gap”—a disparity that exists because the vast majority of biological literature is based on single sex studies of males. Research shows that achieving gender equality in science and medicine will improve our standard of care and long-term health outcomes, not just for women, but for everyone.\n‍Our first product helps individuals identify the best birth control for their unique biology. We do this by integrating two biological readouts: genetics (read one time) and hormone levels (read multiple times throughout your life). By partnering with individuals, adyn provides medically actionable scientific insights and empowers them to proactively optimize their health—from birth control, to fertility, and beyond.", "technology": "adyn analyzes population health data to generate medically actionable insights. Our precision medicine approach combines genetics and endocrinology for the discovery of pharmacological targets and early diagnostics. Our multidisciplinary approach leverages big data from disparate sources to identify robust associations driving a new standard of healthcare."}, "yc_cohort": "S20", "company_details": {"fa-users": "1 person"}, "jobs": [{"job_desc": "adyn is on a mission to make scientific discovery more inclusive so everyone can live their healthiest life. \n‍\nOur vision is to be earth's most inclusive and patient-centric personalized medicine company. We are living in the age of the “medical research gender gap”—a disparity that exists because the vast majority of biological literature is based on single sex studies of males. Research shows that achieving gender equality in science and medicine will improve our standard of care and long-term health outcomes, not just for women, but for everyone.\n‍Our first product helps individuals identify the best birth control for their unique biology. We do this by integrating two biological readouts: genetics (read one time) and hormone levels (read multiple times throughout your life). By partnering with individuals, adyn provides medically actionable scientific insights and empowers them to proactively optimize their health—from birth control, to fertility, and beyond.About the role:Our first full stack engineer will be a champion of our mission and a leader on our team. The full stack engineer will design adyn’s tech stack from ground up. This person will make strategic and scalable technology decisions while writing elegant code and remaining ever vigilant about security. In this role:You are an eager participant of the founding team and a part of all major decisions. You set a high bar for execution, both in terms of quality and speed. You are gratified by refining functionality seamlessly over time. You enjoy hiring, and mentoring new team members. You will collaborate with vendors, marketing, bioinformatics teams to help adyn deliver a new standard of care in both virtual and traditional clinical care settings.In the first month you will:Learn adyn’s existing tech approach and processes—including our scientific approachArchitect the overall structure of a scalable tech stack with an emphasis on efficiency, UX, and data securityExpand product offering by integrating with 3rd party APIBuild a system to store consumer health information and track progression as it transits our existing bioinformatic pipelinesIn the first quarter you will:Build our front end in collaboration with our award winning design firm Catalyze our mission by creating dashboards for each team to track its goalsAutomate tracking systems for complex operational processes involving multiple 3rd party providersCollaborate with our marketing team to optimize campaignsIn the first year you will:Establish, document, and maintain engineering processes as the company scalesBuild a world class engineering team and provide mentorship as neededArchitect a highly customized and scalable backend infrastructure Optimize audit trail for HIPAA compliance (Aptible, Heroku, AWS)Engineer intake surveys with logic jumps to efficiently collect consumer reported health dataSkills:Languages: Fluent with python and modern javascript including ReactAWSSQLEncryption and data securityHIPAA: Aptible, Heroku, and/or AWS (optional)Natural Language Processing (optional)Machine learning (optional)5+ years of experienceTo apply:Please email careers@adynhealth.com. Use the subject line formatting:\nCareers Full Stack Engineer: Last Name, First Name.\nAttach a resume. In the body of your email use 3 - 5 sentences to tell us how you exemplify any of our 6 values and another 3 - 5 sentences to describe the biggest lesson of your engineering career.", "job_type": "Full stack engineer", "job_title": "Full stack engineer", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "min_years_experience": 3}, "job_skills": null}, {"job_desc": "About adynadyn is on a mission to make scientific discovery more inclusive so everyone can live their healthiest life.\n‍\nOur vision is to be earth's most inclusive and patient-centric personalized medicine company. We are living in the age of the “medical research gender gap”—a disparity that exists because the vast majority of biological literature is based on single sex studies of males. Research shows that achieving gender equality in science and medicine will improve our standard of care and long-term health outcomes, not just for women, but for everyone.‍\nOur first product helps individuals identify the best birth control for their unique biology. We do this by integrating two biological readouts: genetics (read one time) and hormone levels (read multiple times throughout your life). By partnering with individuals, adyn provides medically actionable scientific insights and empowers them to proactively optimize their health—from birth control, to fertility, and beyond.About the role:As a founding team member, and mission champion, our bioinformatician will help expand adyn’s product offerings by identifying and prioritizing scientific opportunities for R&D. This person is a leader able to build and mentor a team of top talent while collaborating with large industry players. Our bioinformatician is data obsessed and deeply interested in true prospective study, early diagnostics, pharmacogenomics, endocrinology, genomics, and longitudinal biomarkers. In this role:You are eager to build systems and strategy in green space. You will establish efficient pipelines for processing large volumes of data. You will use data visualization and spoken + written language to communicate scientific and medical findings to diverse audiences. You will collaborate with marketing, regulatory specialists, medical practitioners, and engineering teams. You aim to deliver a new standard of care in both virtual and traditional clinical care settings.In the first month you will:Learn adyn’s scientific approach and processes—including running sample data through our existing pipelineEstablish storage architectures for raw and processed data on the cloudArchitect the overall structure of bioinformatics workflows and guide the implementation and delivery of scalable systemsDesign effective data visualization strategy and create the bioinformatic pipeline for visualization of processed dataIn the first quarter you will:Process consumer dataOptimize pipelines for speed and automationCollaborate on building our knowledge base to prioritizing expanded R&D effortsClearly communicate bioinformatics strategies and data interpretation to those not in the field such as internal stakeholders and consultants (e.g., marketing, regulatory specialists, medical practitioners, and engineering teams)In the first year you will:Use cutting-edge tools to identify novel associations in unique omics datasetsOptimize our recommendation engine with novel data in collaboration with expert medical advisorsEstablish collaborative research projects with both academic and industry partnersBuild a team of passionate and curious bioinformaticiansShare findings with the broader medical community by communicating externally to partners and scientific peers at conferences and in publicationsDraft research proposals for advancing scientific collaborations and internal R&DSkills/Requirements:CuriosityEntrepreneurial mindsetScientific integrityAssess replicability, clinical impact, and utility of genomic associations, polygenic risk scores, pharmacogenomics, and other biological markers across clinical phenotypesGithub, AWS, Python, R, machine learningPopulation genomics experience using GWAS and/or NGSTo apply:Please email careers@adynhealth.com. Use the subject line formatting:\nCareers Bioinformatician: Last Name, First NameAttach a resume. In the body of your email use 3 - 5 sentences to tell us how you exemplify any of our 6 values and another 3 - 5 sentences to explain the research contribution you’re most proud of.", "job_type": "Bioinformatician", "job_title": "Bioinformatician", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "min_years_experience": 6}, "job_skills": null}], "founders": [{"founder_name": "Elizabeth Ruzzo", "founder_img": "./waas_full_details_dump_files/9a0579d1a485abdc01d1fbfbdf6b5d70d1a2c435.jpg", "founder_linkedin": "https://www.linkedin.com/in/elizabethruzzophd", "founder_experience": "Born & raised in Seattle. Extrovert. Soccer. Amateur chef.\n\nPhD in human genomics from Duke University & Postdoctoral Fellowship from UCLA. Accomplished human genetics researcher (author of 20+ peer-reviewed publications, Charles J. Epstein Trainee Awardee for Excellence in Human Genetics Research, Jo Rae Wright Fellowship for Outstanding Women in Science, Neurobehavioral Genetics Fellow, and Ray J. Tysor Graduate Fellowship awardee) with a passion for using big data to transform health care.", "founder_education": null}]}, {"company_name": "Afriex", "company_desc": "Stablecoin remittances", "company_desc_long": {"description": "Afriex app makes it super easy for immigrants to send money home. We do this by leveraging blockchain technology to make transfers faster and cheaper than banks or other transfer services", "technology": "Fullstack javascript"}, "yc_cohort": "S20", "company_details": {"fa-users": "2 people"}, "jobs": [{"job_desc": "Skills:JavaScriptAfriex (Y Combinator S20) makes it easy for immigrants to send money home. We use stablecoins (cryptocurrency backed by the US dollar) to offer the fastest and cheapest remittance service to over 30 countries around the world.We're getting more customer demand than we can handle on our own, so we're looking for a founding engineer!If you want to work with a team of YC-backed founders that deeply care about their work and product & use Blockchain technology to solve tangible, real-world problems at scale, come join us!About the Founding Engineer RoleAs one of the first technical hires outside of the two co-founders, this role is as close to being a founder of a company as you can get without starting one yourself! Your role will be to define and deliver features, fully own parts of the stack, and ultimately do whatever is necessary to make the customers happy. If you enjoy taking responsibility, have lots of ideas for improving product & process, and have thought about starting a company yourself, this role could be for you!You may work in-person or remotely until end of COVID. We do provide relocation assitance. As a founding engineer, you will receive substantial equity compensation, but should expect cash compensation to be below market rates.RequirementsHave experience writing and shipping production-grade code that makes a real impact. We don't mind where you got the experience, but having some is crucial.Be comfortable working across the stack and be curious about new technologies. We would prefer if in addition to this versatility and curiosity, you have deep experience or specialization in one of front-end, back-end, infrastructure or Blockchain technology.Be entrepreneurial. This means finding problems without being told about them, thinking independently about issues and clearly advocating your position, and taking full ownership of your work, even if things go wrong.", "job_type": "Founding Engineer", "job_title": "Founding Engineer", "details": {"visa_required": false, "remote": false, "new_grads_ok": false, "min_years_experience": 3}, "job_skills": ["JAVASCRIPT"]}], "founders": [{"founder_name": "Tope Alabi", "founder_img": "./waas_full_details_dump_files/db167e107d02de914fac68e19868fcba0c3fd583.jpg", "founder_linkedin": "https://www.linkedin.com/in/topealabi", "founder_experience": "Co-founder at afriexapp.com", "founder_education": null}, {"founder_name": "John Obirije", "founder_img": "./waas_full_details_dump_files/64a8f6d339b8e29f8aa40f365e35035a842e05ab.jpg", "founder_linkedin": "https://www.linkedin.com/in/obirije-john-a2403310a/", "founder_experience": "Co-Founder & CTO, Afriex", "founder_education": null}]}, {"company_name": "AgileMD", "company_desc": "Predictive analytics and clinical pathways for hospitals", "company_desc_long": {"description": "At AgileMD, we are building the most advanced real-time predictive analytics and clinical algorithms platform for hospitals. Our cloud-based engine supports and empowers the medical decisions of thousands of physicians across hospitals and clinics around the country, so that every patient receives the highest quality and value of care based on the latest medical knowledge and data.AgileMD is headquartered in San Francisco, California.", "technology": "Linux (primarily CentOS and Ubuntu)\nNode (using ExpressJS and PM2)\nReact\nPostgres (Aurora), MongoDB, ElasticSearch, Redis, DynamoDB\nNginx and AWS ELB\nAdditional AWS tools including EC2, RDS/Aurora, Lambda, CloudWatch, S3/CloudFront, and more."}, "yc_cohort": "S11", "company_details": {"fa-users": "15 people"}, "jobs": [], "founders": [{"founder_name": "Borna Safabakhsh", "founder_img": "./waas_full_details_dump_files/430278f37ea52bc96eb2ad7da0fc78abebb3ac88.jpg", "founder_linkedin": "https://www.linkedin.com/in/bornas/", "founder_experience": "Borna is the co-founder and CEO of AgileMD, a digital health startup reinventing how clinical predictive analytics and decision support help physicians at the bedside.  Borna has an MBA from Chicago Booth, where he was recognized as Most Promising Entrepreneur by the University of Chicago and 50 for the Future by the Illinois Technology Foundation.\n\nAgileMD’s clinical tools are used at over 81 hospitals and individually in use by over 65,000 healthcare providers to deliver high-quality care.", "founder_education": null}]}]